test/result/statistics.json
{
  "/err" : {
    "transaction" : "/err",
    "sampleCount" : 1938,
    "errorCount" : 1938,
    "errorPct" : 100.0,
    "meanResTime" : 169.13467492260028,
    "medianResTime" : 158.5,
    "minResTime" : 5.0,
    "maxResTime" : 636.0,
    "pct1ResTime" : 325.10000000000014,
    "pct2ResTime" : 377.04999999999995,
    "pct3ResTime" : 465.8299999999997,
    "throughput" : 117.93342664151403,
    "receivedKBytesPerSec" : 27.87098559301406,
    "sentKBytesPerSec" : 43.073341371021726
  },
  "Test" : {
    "transaction" : "Test",
    "sampleCount" : 1938,
    "errorCount" : 1938,
    "errorPct" : 100.0,
    "meanResTime" : 368.2936016511864,
    "medianResTime" : 365.0,
    "minResTime" : 16.0,
    "maxResTime" : 1284.0,
    "pct1ResTime" : 622.0,
    "pct2ResTime" : 692.0,
    "pct3ResTime" : 809.8299999999997,
    "throughput" : 113.82591330905674,
    "receivedKBytesPerSec" : 48.46493965112182,
    "sentKBytesPerSec" : 82.81279825707742
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3892,
    "errorCount" : 1938,
    "errorPct" : 49.79445,
    "meanResTime" : 184.11279547790318,
    "medianResTime" : 175.0,
    "minResTime" : 5.0,
    "maxResTime" : 1198.0,
    "pct1ResTime" : 334.0,
    "pct2ResTime" : 392.0,
    "pct3ResTime" : 512.0700000000002,
    "throughput" : 232.28886899433004,
    "receivedKBytesPerSec" : 49.42974112205312,
    "sentKBytesPerSec" : 84.4982141524918
  },
  "/" : {
    "transaction" : "/",
    "sampleCount" : 1954,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 198.9682702149436,
    "medianResTime" : 186.0,
    "minResTime" : 5.0,
    "maxResTime" : 1198.0,
    "pct1ResTime" : 344.0,
    "pct2ResTime" : 405.5,
    "pct3ResTime" : 539.0500000000004,
    "throughput" : 116.70548886101655,
    "receivedKBytesPerSec" : 22.110219569372276,
    "sentKBytesPerSec" : 42.282945671325336
  }
}