test/result/statistics.json
{
  "11" : {
    "transaction" : "11",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9480000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 3.0,
    "throughput" : 87.22958827634334,
    "receivedKBytesPerSec" : 16.099992367411026,
    "sentKBytesPerSec" : 38.07775972609909
  },
  "12" : {
    "transaction" : "12",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8859999999999997,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 86.79048776254122,
    "receivedKBytesPerSec" : 16.018947448359658,
    "sentKBytesPerSec" : 37.88608206040618
  },
  "13" : {
    "transaction" : "13",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9039999999999994,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.990000000000009,
    "throughput" : 82.02099737532808,
    "receivedKBytesPerSec" : 15.138641117125983,
    "sentKBytesPerSec" : 35.80408772145669
  },
  "14" : {
    "transaction" : "14",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9259999999999999,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.990000000000009,
    "throughput" : 76.78132678132678,
    "receivedKBytesPerSec" : 14.171553478194104,
    "sentKBytesPerSec" : 33.51684870239558
  },
  "15" : {
    "transaction" : "15",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9919999999999997,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 6.0,
    "throughput" : 80.0384184408516,
    "receivedKBytesPerSec" : 14.772715903633744,
    "sentKBytesPerSec" : 34.938645549863935
  },
  "16" : {
    "transaction" : "16",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9140000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 72.43227582210633,
    "receivedKBytesPerSec" : 13.368847783572361,
    "sentKBytesPerSec" : 31.618386027813997
  },
  "17" : {
    "transaction" : "17",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9779999999999995,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 4.980000000000018,
    "throughput" : 72.34843003906816,
    "receivedKBytesPerSec" : 13.353372341195197,
    "sentKBytesPerSec" : 31.581785378382293
  },
  "18" : {
    "transaction" : "18",
    "sampleCount" : 491,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9164969450101838,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 3.0,
    "throughput" : 80.3863785199738,
    "receivedKBytesPerSec" : 14.836939004174853,
    "sentKBytesPerSec" : 35.090538279715126
  },
  "19" : {
    "transaction" : "19",
    "sampleCount" : 410,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9268292682926829,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 3.8899999999999864,
    "throughput" : 84.17162800246355,
    "receivedKBytesPerSec" : 15.535583684048449,
    "sentKBytesPerSec" : 36.74288839560665
  },
  "1" : {
    "transaction" : "1",
    "sampleCount" : 715,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.0503496503496477,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 29.680000000000064,
    "throughput" : 24.119552017271623,
    "receivedKBytesPerSec" : 20.2331007644886,
    "sentKBytesPerSec" : 8.620855506173257
  },
  "2" : {
    "transaction" : "2",
    "sampleCount" : 529,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.1871455576559553,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 4.0,
    "throughput" : 18.592717559398288,
    "receivedKBytesPerSec" : 3.4316636901623787,
    "sentKBytesPerSec" : 8.116156981495148
  },
  "3" : {
    "transaction" : "3",
    "sampleCount" : 502,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.0856573705179295,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 19.224141232336383,
    "receivedKBytesPerSec" : 3.5482057547964616,
    "sentKBytesPerSec" : 8.391788213724965
  },
  "4" : {
    "transaction" : "4",
    "sampleCount" : 501,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.0079840319361284,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 19.540543702952533,
    "receivedKBytesPerSec" : 3.6066042576738564,
    "sentKBytesPerSec" : 8.529905307831818
  },
  "5" : {
    "transaction" : "5",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.0979999999999999,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 112.71415689810641,
    "receivedKBytesPerSec" : 20.80368716185753,
    "sentKBytesPerSec" : 49.20237122407575
  },
  "Test" : {
    "transaction" : "Test",
    "sampleCount" : 491,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.635437881873713,
    "medianResTime" : 21.0,
    "minResTime" : 14.0,
    "maxResTime" : 52.0,
    "pct1ResTime" : 25.0,
    "pct2ResTime" : 28.399999999999977,
    "pct3ResTime" : 47.15999999999997,
    "throughput" : 297.0356926799758,
    "receivedKBytesPerSec" : 1226.9606870084694,
    "sentKBytesPerSec" : 2418.7113628629763
  },
  "6" : {
    "transaction" : "6",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.0700000000000003,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 107.34220695577501,
    "receivedKBytesPerSec" : 19.812184682267066,
    "sentKBytesPerSec" : 46.85738916917131
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 9648,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.145211442786076,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 325.24271844660194,
    "receivedKBytesPerSec" : 75.80085762624729,
    "sentKBytesPerSec" : 140.0694615632585
  },
  "7" : {
    "transaction" : "7",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.0960000000000003,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 4.0,
    "throughput" : 91.50805270863836,
    "receivedKBytesPerSec" : 16.889669884699853,
    "sentKBytesPerSec" : 39.945409727306
  },
  "8" : {
    "transaction" : "8",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.0299999999999991,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 5.990000000000009,
    "throughput" : 94.32182607055273,
    "receivedKBytesPerSec" : 17.409008913412563,
    "sentKBytesPerSec" : 41.17368774759479
  },
  "9" : {
    "transaction" : "9",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9959999999999993,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 6.0,
    "throughput" : 87.56567425569177,
    "receivedKBytesPerSec" : 16.162023861646233,
    "sentKBytesPerSec" : 38.224469133099824
  },
  "10" : {
    "transaction" : "10",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8819999999999998,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 90.57971014492753,
    "receivedKBytesPerSec" : 16.718325407608695,
    "sentKBytesPerSec" : 39.5401664402174
  }
}